In [1]:
import numpy as np
import pandas as pd

In [2]:
data = {'Name': ['John', 'Emily', 'James', 'Emma', 'Daniel'],
        'Age': [25, 32, 18, 27, 35],
        'City': ['New York', 'Los Angeles', 'Chicago', 'San Francisco', 'Boston'],
        'Salary': [50000, 70000, 40000, 60000, 80000]}
df = pd.DataFrame(data)

In [3]:
df

     Name  Age           City  Salary
0    John   25       New York   50000
1   Emily   32    Los Angeles   70000
2   James   18        Chicago   40000
3    Emma   27  San Francisco   60000
4  Daniel   35         Boston   80000

In [5]:
df[df['Age'] >= 25]

     Name  Age           City  Salary
0    John   25       New York   50000
1   Emily   32    Los Angeles   70000
3    Emma   27  San Francisco   60000
4  Daniel   35         Boston   80000